In [1]:
import pandas as pd
data1 = pd.read_csv("data/ex9.csv")

In [2]:
data1.head()

   year  sales  amount
0  2010  sale1     200
1  2011  sale1     328
2  2012  sale1     870
3  2013  sale1     209
4  2014  sale1     348

In [4]:
data1.pivot(index='year', columns='sales', values='amount')

sales  sale1  sale2  sale3
year
2010     200    258    592
2011     328    664    606
2012     870    249    918
2013     209    971    629
2014     348    863    929
2015     475    999    610
2016     944    356    540
2017     190     12    673
2018     129    936     14
2019      31    877    181
2020     646    768    862
2021     284    792    688

In [13]:
data2 = pd.read_csv('data/ex10.csv')
data2.head()

     date company closing price
0  30-Apr  google      2,410.12
1  29-Apr  google      2,429.89
2  28-Apr  google      2,379.91
3  27-Apr  google      2,307.12
4  26-Apr  google      2,326.74

In [6]:
data2.pivot(index='date', columns='company', values='closing price')

company   apple    google
date
20-Apr   132.88  2,293.63
21-Apr   133.27  2,293.29
22-Apr   131.72  2,267.92
23-Apr   134.09  2,315.30
26-Apr   134.49  2,326.74
27-Apr   134.16  2,307.12
28-Apr   133.35  2,379.91
29-Apr   133.25  2,429.89
30-Apr   131.24  2,410.12

In [7]:
data2

      date company closing price
0   30-Apr  google      2,410.12
1   29-Apr  google      2,429.89
2   28-Apr  google      2,379.91
3   27-Apr  google      2,307.12
4   26-Apr  google      2,326.74
5   23-Apr  google      2,315.30
6   22-Apr  google      2,267.92
7   21-Apr  google      2,293.29
8   20-Apr  google      2,293.63
9   30-Apr   apple        131.24
10  29-Apr   apple        133.25
11  28-Apr   apple        133.35
12  27-Apr   apple        134.16
13  26-Apr   apple        134.49
14  23-Apr   apple        134.09
15  22-Apr   apple        131.72
16  21-Apr   apple        133.27
17  20-Apr   apple        132.88

In [10]:
frame1= data2.set_index(['date', 'company'])

In [11]:
frame1

               closing price
date   company
30-Apr google       2,410.12
29-Apr google       2,429.89
28-Apr google       2,379.91
27-Apr google       2,307.12
26-Apr google       2,326.74
23-Apr google       2,315.30
22-Apr google       2,267.92
21-Apr google       2,293.29
20-Apr google       2,293.63
30-Apr apple          131.24
29-Apr apple          133.25
28-Apr apple          133.35
27-Apr apple          134.16
26-Apr apple          134.49
23-Apr apple          134.09
22-Apr apple          131.72
21-Apr apple          133.27
20-Apr apple          132.88

In [12]:
frame1.unstack('company')

        closing price
company         apple    google
date
20-Apr         132.88  2,293.63
21-Apr         133.27  2,293.29
22-Apr         131.72  2,267.92
23-Apr         134.09  2,315.30
26-Apr         134.49  2,326.74
27-Apr         134.16  2,307.12
28-Apr         133.35  2,379.91
29-Apr         133.25  2,429.89
30-Apr         131.24  2,410.12